import { FC, useState } from 'react';
import { Article, Visitcard } from './AboutFaculty.styles.tsx';
import { FaChevronDown } from 'react-icons/fa6';
import ExternalLink from '../../ui/ExternalLink.tsx';

const AboutFaculty: FC = () => {
  const [openLawsList, setOpenLawsList] = useState<boolean>(true);
  return (
    <>
      <h2>Дошкільна освіта - перша самоцінна ланка в системі освіти України</h2>
      <Visitcard>
        <figure>
          <img
            src={
              'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/announcements%2Fdean-photo-index.webp?alt=media'
            }
            alt="Dean"
          />
          <figcaption>
            <span>Куліш Інна Дмитрівна</span> - декан факультету
          </figcaption>
        </figure>
        <p>
          «Дитинство – це не підготовка до майбутнього життя, а справжнє,
          яскраве, самобутнє, неповторне життя. Від того, яким воно було, хто
          супроводжував дитину в дитячі роки, що увібрали її розум і серце з
          навколишнього світу, залежать якості її як особистості. Бо кожну
          людську рису природа закладає, а не відшліфовує. Відшліфовувати їх
          належить батькам, педагогам, суспільству»
          <span>В. Сухомлинський</span>
        </p>
      </Visitcard>

      <Article>
        <h3>ШАНОВНІ КОЛЕГИ, ВСТУПНИКИ, СТУДЕНТИ !</h3>
        <p>
          Вітаю Вас на сторінці веб-сайту одного з найстаріших факультетів
          Глухівського національного педагогічного університету імені Олександра
          Довженка – факультету дошкільної освіти!
        </p>
        <p>
          Глухівський національний педагогічний університет – гордість та краса
          древнього міста. За століття свого існування він подарував світові
          талановитих письменників, видатних діячів науки і культури. З 1874
          року і до наших днів наш університет пройшов шлях від учительського
          інституту, який готував на своєму єдиному факультеті вчителів для
          міських училищ Чернігівської та Полтавської губерній, до вищого
          навчального закладу, що вчить майстрів педагогічної справи вже на 6-и
          факультетах.
        </p>
        <p>
          Створений у 1986 році, факультет дошкільної освіти став спадкоємцем
          кращих освітянських традицій найстарішого вищого навчального закладу
          України, якому у 2020р. виповнюється 145 років від заснування. За цей
          час він став науково-методичним центром підготовки майбутніх фахівців
          з дошкільної освіти та удосконалення професійної майстерності
          педагогічних кадрів Сіверщини. Саме тут забезпечуються умови для
          одержання спеціальної педагогічної освіти здібним та талановитим
          дівчатам та юнакам, які за своїм покликанням – педагоги.
        </p>
        <p>
          Метою діяльності факультету є задоволення зростаючих освітніх та
          культурних потреб громадян України, забезпечення якості підготовки
          фахівців у галузі дошкільної освіти відповідно до діючих вітчизняних і
          міжнародних освітніх стандартів та високого рівня
          конкурентоспроможності випускників на ринку праці, підвищення їхньої
          професійної мобільності, адаптивності та гнучкості.
        </p>
        <p
          onClick={() => setOpenLawsList(!openLawsList)}
          style={{ cursor: 'pointer' }}
        >
          Освітня діяльність факультету дошкільної освіти забезпечується:{' '}
          <FaChevronDown
            style={{
              transition: 'transform 0.3s',
              transform: openLawsList ? 'rotate(-90deg)' : undefined
            }}
          />
        </p>
        <ul style={openLawsList ? { display: 'none' } : undefined}>
          <li>Законами України «Про вищу освіту», «Про освіту»;</li>
          <li>
            Графіком зарахування на навчання здобувачів освіти у 2022 році (на
            підставі правил прийому на навчання до Глухівського НПУ ім. О.
            Довженка у 2022 році);
          </li>
          <li>
            Стандартами й рекомендаціями щодо забезпечення якості в
            Європейському просторі вищої освіти (схвалено Міністерською
            конференцією в Єревані 14-15 травня 2015 р.);
          </li>
          <li>
            положенням «Про внутрішню систему забезпечення якості освіти в
            Глухівському національному педагогічному університеті імені
            Олександра Довженка»;
          </li>
          <li>
            постановою Кабінету Міністрів України від 24 березня 2021 р. № 365
            «Про внесення змін до постанови Кабінету Міністрів України від 30
            грудня 2015р. № 1187»;
          </li>
          <li>
            постановою Кабінету Міністрів України від 20 травня 2013 року № 363
            «Про затвердження Порядку розміщення державного замовлення на
            підготовку фахівців, наукових, науково-педагогічних та робітничих
            кадрів, підвищення кваліфікації та перепідготовку кадрів»;
          </li>
          <li>
            методичними рекомендаціями щодо розроблення стандартів вищої освіти
            (затверджені наказом МОН України «Про затвердження та введення в дію
            Методичних рекомендацій щодо розроблення стандартів вищої освіти»
            від 01.06.2016 №600); стандартами вищої освіти спеціальностей
            (затвердженими наказами МОНУ);
          </li>
          <li>
            постановою КМУ від 24 грудня 2019 року №1146 «Про розподіл видатків
            державного бюджету між закладами вищої освіти на основі показників
            їх освітньої, наукової та міжнародної діяльності», із змінами,
            внесеними згідно з Постановою КМ № 709 від 07.07.2021;
          </li>
          <li>
            наказом МОН України від 06.11.2015 №1151 «Про особливості
            запровадження переліку галузей знань і спеціальностей, за якими
            здійснюється підготовка здобувачів вищої освіти, затвердженого
            постановою Кабінету Міністрів України від 29 квітня 2015 року №
            266»;
          </li>
          <li>
            наказом МОН України від 12.05.2016 №506 (зі змінами від 17.04.2019№
            506) «Про затвердження Переліку предметних спеціалізацій
            спеціальності 014 Середня освіта (за предметними спеціалізаціями)»,
            за якими здійснюється формування і розміщення державного замовлення
            та поєднання спеціальностей (предметних спеціалізацій) в системі
            підготовки педагогічних кадрів»;
          </li>
          <li>
            наказом МОН України від 21.03.2016 №292 «Про затвердження Переліку
            спеціалізацій підготовки здобувачів вищої освіти за спеціальністю
            015 Професійна освіта (за спеціалізаціями)», за якими здійснюється
            формування та розміщення державного замовлення» зі змінами,
            внесеними згідно з наказом МОНУ № 153 від 09.02.2021;
          </li>
          <li>
            наказом Міністерства з питань реінтеграції тимчасово окупованих
            територій України від 25 квітня 2022 року №75 (у редакції наказу
            Міністерства з питань реінтеграції тимчасово окупованих територій
            України від 27 липня 2022 року №169);
          </li>
          <li>
            наказом Департаменту освіти і науки Сумської обласної державної
            адміністрації №189-ОД від 05.08.2022 року «Про підготовку закладів
            освіти до нового 2022/2023 навчального року»;
          </li>
          <li>
            ліцензією на освітню діяльність у сфері вищої освіти Глухівського
            національного педагогічного університету імені Олександра Довженка
            (ідентифікаційний код – 02125527), що затверджена наказом
            Міністерства освіти і науки України №116-л від 02.06.2017 та
            розміщена у вигляді Відомостей про право здійснення освітньої
            діяльності у сфері вищої освіти на офіційному веб-сайті МОН (
            <ExternalLink
              href="https://mon.gov.ua/storage/app/media/05.%2001.%202021/VO%202021/49-vo-21.pdf"
              text="за покликанням"
            />
            );
          </li>
          <li>
            нормами планування навантаження ПВС, що передбачені наказом МОН
            України від 16.02.2022 №186 «Про затвердження рекомендованого
            переліку видів навчальної, методичної, наукової та організаційної
            роботи для науково-педагогічних, наукових і педагогічних
            працівників»;
          </li>
          <li>
            положенням «Про планування та облік основних видів роботи
            професорсько-викладацького складу Глухівського національного
            педагогічного університету імені Олександра Довженка»
          </li>
          <li>
            положенням «Про організацію освітнього процесу в Глухівському НПУ
            ім. О. Довженка»;
          </li>
          <li>
            положенням «Про навчання і викладання за освітніми програмами ОС
            «Бакалавр», ОС «Магістр» у Глухівському національному педагогічному
            університеті імені Олександра Довженка»;
          </li>
          <li>
            положенням «Про контроль і оцінювання навчальних досягнень
            здобувачів вищої освіти в Глухівському національному педагогічному
            університеті імені Олександра Довженка»;
          </li>
          <li>
            положенням «Про організацію, проведення практичної підготовки
            здобувачів освіти у Глухівському національному педагогічному
            університеті імені Олександра Довженка»;
          </li>
          <li>
            положенням «Про індивідуальний навчальний план здобувачів освіти за
            ОС «Бакалавр», «Магістр» Глухівського НПУ ім. О. Довженка»;
          </li>
          <li>
            положенням «Про електронний журнал обліку успішності студентів
            Глухівського НПУ ім. О. Довженка»;
          </li>
          <li>
            наказом ректора від 17.06.2016 №169 «Заходи з коригування процесу
            переходу на навчальне навантаження 600 год. науково-педагогічних
            працівників Глухівського НПУ ім. О. Довженка» та ін.;
          </li>
          <li>
            наказами Глухівського НПУ ім. О. Довженка від 30.06.2022 «Про
            підсумки діяльності Глухівського НПУ ім. О. Довженка у 2021-2022н.р.
            та планування роботи на 2022-2023 н. р.», №231 від 27.07.2022 «Про
            внесення змін до наказу №211 від 30.06.2022»)
          </li>
        </ul>
        <p>
          Дошкільна освіта, як перша самоцінна ланка в системі освіти України,
          створює міцне підґрунтя для подальшого навчання і виховання
          підростаючого покоління у шкільні роки. Якісна підготовка фахівців для
          закладів дошкільної освіти здійснюється саме на факультеті дошкільної
          освіти.
        </p>
        <p>
          <b>
            <em>Запрошуємо Вас до спілкування і співпраці!</em>
          </b>
        </p>
      </Article>
    </>
  );
};
export default AboutFaculty;
