{
  "preschoolEnglish": {
    "title": "Дошкільна освіта та мова і література (англійська)",
    "degree": "Бакалавр",
    "specialty": "012 Дошкільна освіта",
    "qualification": "«Бакалавр дошкільної освіти. Вихователь закладу дошкільної освіти. Керівник гуртка іноземної мови (англійської).",
    "guarantor": {
      "name": "Любива Віталіна Вячеславівна",
      "linkTo": "/about/departments/ktmdo/liubiva-vitalina",
      "description": "кандидат педагогічних наук, старший викладач кафедри теорії і методики дошкільної освіти факультету дошкільної освіти Глухівського національного педагогічного університету імені Олександра Довженка."
    }
  },
  "preschoolPhysical": {
    "title": "Дошкільна освіта та фізична культура",
    "degree": "Бакалавр",
    "specialty": "012 Дошкільна освіта",
    "qualification": "«Бакалавр дошкільної освіти. Вихователь закладу дошкільної освіти. Методист з фізичної культури.",
    "guarantor": {
      "name": "Хлус Наталія Олександрівна",
      "linkTo": "/about/departments/ktmfv/hlys-natalia",
      "description": "кандидат наук з фізичного виховання і спорту, доцент, завідувач кафедри теорії і методики фізичного виховання факультету дошкільної освіти Глухівського національного педагогічного університету імені Олександра Довженка."
    }
  },
  "physicalSportTourist": {
    "title": "Середня освіта (Фізична культура та організація спортивно-масової і туристичної роботи)",
    "degree": "Бакалавр",
    "specialty": "014 Середня освіта (Фізична культура)",
    "qualification": "Бакалавр середньої освіти. Вчитель фізичної культури. Організатор спортивно-масової і туристичної роботи",
    "guarantor": {
      "name": "Бутенко Галина Олександрівна",
      "linkTo": "/about/departments/ktmfv/butenko-halyna",
      "description": "кандидат наук з фізичного виховання і спорту, доцент, доцент кафедри теорії і методики фізичного виховання факультету дошкільної освіти Глухівського національного педагогічного університету імені Олександра Довженка."
    }
  }
}