import SelectiveOkTable from './SelectiveOkTable.tsx';

import educationComponents from '../../data/selective-ok-syllabus.json';
import LazySuspense from '../../ui/LazySuspense.tsx';

function SelectiveOkPhysical() {
  return (
    <LazySuspense>
      <h2>Вибіркові ОК спеціальності 014 Середня освіта (Фізична культура)</h2>
      <h3>Шановні студенти!</h3>
      <p>
        Оголошується вибір навчальних дисциплін на 2023-2024 навчальний рік!
        <br />
        Зробіть свій вибір до 1 квітня 2023 року.
      </p>
      <h3>
        <u>Студенти 13 ФК, 63-12 ФК</u>
      </h3>
      <p>
        У 3 семестрі обирають 3 дисципліни (1-21 кредит, 1-6 кредитів, 1-3
        кредити)
      </p>
      <p>У 4 семестрі обирають 2 дисципліни (1-21 кредит, 1-6 кредитів)</p>
      <h3>
        <u>Студенти 15 ФК</u>
      </h3>
      <p>3 семестр 3 дисципліни (1-21 кредит, 2-3 кредити)</p>
      <p>4 семестр 7 дисциплін (1-21 кредит, 1-6 кредитів, 5-3 кредити)</p>{' '}
      <h3>
        <u>Студенти 23 ФК</u>
      </h3>
      <p>5 семестр 1 дисципліна (1-18 кредитів)</p>
      <p>
        6 семестр 3 дисципліни (1-18 кредитів, 2-3 кредити з них 1-із загально
        університетського переліку)
      </p>{' '}
      <h3>
        <u>Студенти 33-ФК, 63-32 ФК</u>
      </h3>
      <p>7 семестр 3 дисципліни (3-3 кредити)</p>
      <p>8 семестр 3 дисципліни (3-3 кредити)</p>
      <SelectiveOkTable syllabusList={educationComponents.physical} />
      <h3>
        <u>Студенти 6М-ФК, 63 М-ФК</u>
      </h3>
      <p>
        3 семестр 5 дисциплін (1-по 4 кредити, 4-по 3 кредити з них 1-із
        загальноуніверситетського переліку)
      </p>
      <SelectiveOkTable syllabusList={educationComponents.physicalMaster} />
    </LazySuspense>
  );
}
export default SelectiveOkPhysical;
