import { HeroCard } from './War.styles.tsx';

function StudentWar() {
  const deadHero = [
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Fbyzovskii-volodimyr.jpg?alt=media',
      name: 'БУЗОВСЬКИЙ ВОЛОДИМИР ОЛЕКСАНДРОВИЧ',
      text: [
        'БУЗОВСЬКИЙ ВОЛОДИМИР ОЛЕКСАНДРОВИЧ вступив у 2017 р. на факультет педагогіки та психології Глухівського НПУ імені О. Довженка спеціальність 014 Середня освіта (Фізична культура). Народився у с. Локня, Кролевецького району, Сумської області.',
        'З травня 2014-го по березень 2015 року служив за мобілізацією в НГУ. У травні 2016-го обраний депутатом Локнянської сільської ради. Від березня 2016 року проходив військову службу за контрактом у 58-й бригаді, з 2017-го — у 72-й бригаді; старший сержант.',
        '23 вересня 2018-го поблизу смт Луганське Володимир загинув, внаслідок прямого влучення снаряду. Знайдене обгоріле тіло військовика 25 вересня у бліндажі, за 160 метрів від лінії розмежування.',
        'Після проведення експертизи ДНК 16 листопада 2018 року похований в селі Локня.',
        'Нагороди та вшанування:'
      ],
      awards: [
        "Указом Президента України №26/2019 від 31 січня 2019 року «за особисту мужність і самовіддані дії, виявлені у захисті державного суверенітету та територіальної цілісності України, зразкового виконання військового обов'язку» — нагороджений орденом «За мужність» III ступеня. Посмертно.",
        'Наказом Міністра оборони України #747 від 12 серпня 2016 року нагороджений Нагрудним знаком «Знак пошани».',
        'Наказом Міністерства оборони України # 531 від 07 серпня 2017 року нагороджений Нагрудним знаком "За зразкову службу".',
        'Наказом ВО «Країна» # 11 від 01 листопада 2019 року нагороджений медаллю «За незламність духу». Посмертно.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Fmaximov-mikola.jpg?alt=media',
      name: 'МАКСИМОВ МИКОЛА ВАЛЕРІЙОВИЧ',
      text: [
        'МАКСИМОВ МИКОЛА ВАЛЕРІЙОВИЧ вступив у 2018 році на факультет дошкільної освіти Глухівського НПУ імені О. Довженка спеціальність 014 Середня освіта (Фізична культура). Народився у м. Глухів, Сумської області.',
        'З 2015 року перебував на військовій службі у складі ЗС України, був учасником війни на сході України в складі АТО та ООС. Обіймав військову посаду командира відділення розвідувального взводу 15-го окремого мотопіхотного батальйону «Суми»58-мої окремої мотопіхотної бригади імені гетьмана Івана Виговського.',
        'З початком повномасштабного російського вторгнення в Україну перебував на передовій.',
        'Загинув 6 травня 2022 року поблизу м. Попасної на Луганщині під час мінометного обстрілу. За словами побратимів, Микола Максимов виводив людей в безпечне місце, але сам загинув.',
        'Нагороджений орденом “За мужність” III ступеня. Посмертно.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Fpronevich-serhii.jpg?alt=media',
      name: 'ПРОНЕВИЧ СЕРГІЙ ІВАНОВИЧ',
      text: [
        'ПРОНЕВИЧ СЕРГІЙ ІВАНОВИЧ випускник 2021 р. факультету дошкільної освіти Глухівського НПУ імені О. Довженка спеціальності 014 Середня освіта (Фізична культура). Народився у с. Боромля, Сумської області.',
        'Сергій був добрим, цілеспрямованим і наполегливим спортсменом. Неодноразовий переможець та призер змагань всеукраїнського і міжнародного рівнів. Улюблена дистанція - напів марафон, у народі кажуть  "половинка". На змаганнях в Одесі став рекордсменом України. Адже єдиний, хто зміг пробігти 42 кілометри марафону у повній амуніції військового українського солдата.',
        'Коли у лютому 2022 року в його рідне село Боромля вдерлися окупанти, Сергій став партизаном.',
        'З 12 березня він не вийшов на зв’язок. Як стало потім відомо його знайшли біля телевізійної вежі, що за кілька кілометрів від с. Боромля. Спочатку спортсмена катували, потім – розстріляли. Там і знайшли його тіло після визволення села – через тиждень після зникнення. ',
        'У День Гідності та Свободи Президент України нагородив Сергія Проневича орденом “За мужність” III ступеня. Посмертно.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Fscorencov-valerii.jpg?alt=media',
      name: 'СКОРЕНЦОВ ВАЛЕРІЙ АНАТОЛІЙОВИЧ',
      text: [
        'СКОРЕНЦОВ ВАЛЕРІЙ АНАТОЛІЙОВИЧ випускник 2013 р. факультету педагогіки та психології  Глухівського НПУ імені О. Довженка спеціальність 014 Середня освіта (Фізична культура). Народився у с. Федірки колишнього Світловодського району, мешкав у м. Олександрія, Кіровоградської області.',
        'Із 2014 по 2016 рік працював вчителем фізичної культури в ліцеї інформаційних технологій Олександрійської міської ради та тренером патріотично-спортивного клубу "Захист"',
        'З вересня 2016 по липень 2022 року служив в окремому загоні спецпризначення Центрального територіального управління Національної гвардії України.',
        'Старший лейтенант, командир 3-го взводу оперативного призначення роти на бронеавтомобілях. Майстер спорту України з панкратіону та майстер спорту міжнародного класу з військово-спортивного багатоборства. 8 листопада 2022 року загинув у бою за визволення Херсонської області від окупантів Росії.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Ftabica-ivan.jpg?alt=media',
      name: 'ТАБІРЦА ІВАН ІВАНОВИЧ',
      text: [
        'ТАБІРЦА ІВАН ІВАНОВИЧ випускник 2015 р. факультету педагогіки та психології Глухівського НПУ імені О. Довженка спеціальність 014 Середня освіта (Фізична культура). Народився у смт. Короп, Чернігівської області.',
        'Був працьовитий, трудився вдома, допомагав родичам – десь дрова порубати, город викосити, це була не проблема. Не сидів ніколи без діла, завжди чимось займався, постійно був у русі, завжди прагнув себе проявити.',
        'Дружив з однолітками, молодші «тягнулися» до нього. Якийсь час Іван – навчаючись у старших класах — навіть проводив спортивні тренування з дітьми. Спорт – то окрема сторінка біографії Івана. Він був кращим у боксі, у волейболі, в силових дисциплінах...',
        'Спортсмен-чемпіон, красень, справжній богатир, мужній, дуже сильний і витривалий.',
        'Після закінчення школи служив у армії — у 25-ій окремій Дніпропетровській повітряно-десантній бригаді.  Справжній воїн. Молодий чоловік став на захист України ще у 2014 році, у складі 41-го Чернігівського батальйону територіальної оборони. А з першого дня повномасштабного вторгнення росії пішов боронити Україну від загарбника. 5 січня під час бойових дій у Соледарі на Донеччині Іван загинув.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Ftischenko-ihor.jpg?alt=media',
      name: 'ТИЩЕНКО ІГОР ВОЛОДИМИРОВИЧ',
      text: [
        'ТИЩЕНКО ІГОР ВОЛОДИМИРОВИЧ випускник 2022 р. факультету дошкільної освіти Глухівського НПУ імені О. Довженка спеціальності 014 Середня освіта (Фізична культура). Народився у с. Дунаєць, Глухівського р-н, Сумської області.',
        'Ігор був лейтинантом 16 окремого мотопіхотного батальйону та займав посаду заступника командира роти з морально-психологічного забезпечення. 2 червня 2022 р. під час обстрілу ворожими російськими військами в районі с. Покровське Донецької області він загинув.',
        'До служби в ЗСУ працював в Глухівському ліцеї – інтернаті з посиленою військово-фізичною підготовкою, де був офіцером – вихователем і вів гурток бойового мистетства.',
        'Він завжди намагався виконати все вчасно і якісно. Заряджав всіх своїм позитивним настроєм і оптимізмом. Ігор дивився на цей світ через призму краси та творчості, а в усіх його справах і починаннях була лаконічність та креативність.'
      ]
    },
    {
      imgUrl:
        'https://firebasestorage.googleapis.com/v0/b/fdo-gnpu.appspot.com/o/student%2Fwar%2Flykynin-serhii.webp?alt=media',
      name: 'ЛУКУНІН СЕРГІЙ ВІТАЛІЙОВИЧ',
      text: [
        'ЛУКУНІН СЕРГІЙ ВІТАЛІЙОВИЧ випускник 2015 р. факультету педагогіки та психології Глухівського НПУ імені О. Довженка спеціальності 014 Середня освіта (Фізична культура). Житель м. Білгород – Дністровськ, Одеської області.',
        'Сергій загинув в боях з російськими окупантами під містом Миколаїв 16 березня в ході відбиття російського вторгнення в Україну. Мав звання старший лейтенант Збройних Сил України.',
        'Сергій був добрим, веселим, активним, життєрадісний та цілеспрямованим. Завжди готовий прийти на допомогу іншим. Його поважили побратими та друзі.',
        'Нагороджений орденом Боглана Хмельницького ІІІ ступеня (посмертно).'
      ]
    }
  ];
  return (
    <>
      <h2>ВОНИ ЗДОБУВАЛИ ПЕРЕМОГУ</h2>
      {deadHero.map(({ imgUrl, text, name, awards }, index) => (
        <HeroCard key={index}>
          <img src={imgUrl} alt={name} />
          {text.map((paragraph, index) => (
            <p key={index}>{paragraph}</p>
          ))}
          {awards && (
            <ul>
              {awards.map((award, index) => (
                <li key={index}>{award}</li>
              ))}
            </ul>
          )}
          <p>
            <b>
              Слава ГЕРОЯМ!
              <br />
              Вічна пам’ять!
            </b>
          </p>
        </HeroCard>
      ))}
    </>
  );
}
export default StudentWar;
