import ExternalLink from '../../ui/ExternalLink.tsx';
import { OrderedList } from './Military.styles.tsx';

function Military() {
  return (
    <>
      <h2>
        ОБОВ'ЯЗКИ СТУДЕНТА <br /> ЩОДО ВІЙСЬКОВОГО ОБЛІКУ
      </h2>
      <h3>
        До уваги студентів, які є військовозобов’язаними або призовниками:
      </h3>
      <OrderedList>
        <li>
          Військовозобов’язані студенти та призовники зобов’язані ознайомитися і
          дотримуватися{' '}
          <ExternalLink
            href="https://zakon.rada.gov.ua/laws/show/1487-2022-%D0%BF#n358"
            text="Правил військового обліку призовників і військовозобов’язаних (постанова
            Кабінету Міністрів України від 30 грудня 2022 р. № 1487)"
          />
          .
        </li>
        <li>
          Зарахування на військовий облік за місцем навчання в Глухівському
          національному педагогічному університеті імені Олександра Довженка
          здійснюється у відділі кадрів на підставі поданих під час вступу
          (поновлення на навчання) військово-облікових документів (посвідчення
          про приписку до призовної дільниці, військовий квиток або тимчасове
          посвідчення замість військового квитка). Військові документи мають
          бути актуальні!
        </li>
        <li>
          Згідно з Порядком організації та ведення військового обліку
          призовників, військовозобов’язаних та резервістів університет збирає
          такі дані про призовників та військовозобов’язаних студентів{' '}
          <ExternalLink
            href="https://zakon.rada.gov.ua/laws/show/1487-2022-%D0%BF#n382"
            text="(див. додаток 5)"
          />
          . Університет надсилає у семиденний строк з дня видання наказу про
          зарахування, відрахування із закладу освіти до відповідних районних
          (міських) територіальних центрів комплектування та соціальної
          підтримки повідомлення про зміну облікових даних призовників,
          військовозобов’язаних та резервістів{' '}
          <ExternalLink
            href="https://drive.google.com/file/d/1oH1yz3e1wnb-NbyIMX059yfgDDQsqahL/view?usp=sharing"
            text="(додаток 4)"
          />
          .
        </li>
        <li>
          Відповідно до статті 23 Закону України “Про мобілізаційну підготовку
          та мобілізацію” студенти, які навчаються за денною / дуальною формами
          навчання <strong>НЕ підлягають</strong> призову на військову службу
          під час мобілізації.
        </li>
      </OrderedList>
      <p>
        Проте, у разі зміни місця проживання у період воєнного стану (незалежно
        від місця реєстрації) у осіб чоловічої статі віком 18-60 років – може
        виникнути необхідність стати на облік до місцевого ТЦК та СП за місцем
        нового перебування та надати їм довідку Ф-20 про статус студента. У разі
        потреби такої довідки заповнюйте{' '}
        <ExternalLink href="https://forms.gle/1Ljbn1WBaqJ7qLnr7" text="ФОРМУ" />
        .
      </p>
      <p>
        Для отримання довідки Вам потрібно заповнити всі обов’язкові поля форми
        та звернутися до відділу кадрів Глухівського національного педагогічного
        університету імені Олександра Довженка.
      </p>
      <p>
        <b>У разі неправильного заповнення форми довідка надана не буде.</b>
      </p>
    </>
  );
}
export default Military;
