import { PageContainer } from './TrustMailbox.styles.tsx';
import { FaRegEnvelope } from 'react-icons/fa6';

function TrustMailbox() {
  return (
    <PageContainer>
      <h2>ЕЛЕКТРОННА СКРИНЬКА ДОВІРИ:</h2>
      <a href="mailto:dovira.fdo.gnpu@gmail.com">
        <FaRegEnvelope size="1.2em" style={{ verticalAlign: 'bottom' }} />
        &nbsp;dovira.fdo.gnpu@gmail.com
      </a>
      <p>
        На факультеті дошкільної освіти Глухівського НПУ ім.О.Довженка створено
        «Скриньку довіри», до якої може звернутися кожен: студент, абітурієнт,
        співробітник, гість.
      </p>
      <p>
        Якщо Ви стали свідком або Вам стало відомо про вчинення корупційних
        правопорушень чи інших неправомірних дій адміністрацією чи
        співробітниками факультету/університету, Ви маєте змогу скористатися
        «Скринькою довіри».
      </p>
      <p>
        Ви можете використати «скриньку» для висловлення будь-яких інших
        побажань, зауважень, в тому числі пов’язаних з процесом навчання,
        взаємодії з керівним або викладацьким складом.
      </p>
      <p>
        Будемо завжди раді почути Ваші пропозиції та побажання щодо покращення
        діяльності нашого закладу.
      </p>
      <p>
        Усі повідомлення, у тому числі анонімні, будуть вивчатися. Анонімні
        повідомлення будуть розглядатись, якщо наведена в них інформація
        стосується конкретної особи, містить фактичні дані, які можуть бути
        перевірені.
      </p>
      <p>Адміністрація факультету гарантує повну конфіденційність.</p>
    </PageContainer>
  );
}
export default TrustMailbox;
